# EdgeEndPoint Class

---
Represents the start or the end point of an Edge.
SystemObject Autodesk.Revit.DBEdgeEndPoint
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class EdgeEndPoint : IDisposable

    Public Class EdgeEndPoint
    	Implements IDisposable

    public ref class EdgeEndPoint : IDisposable

    type EdgeEndPoint =
        class
            interface IDisposable
        end
The EdgeEndPoint type exposes the following members.
| Name| Description
---|---|---
| EdgeEndPoint|  Constructs an instance of EdgeEndPoint.
Top
| Name| Description
---|---|---
| Edge|  The Edge.
| Index|  The index of the start or the end point of an Edge: 0 is the start point, 1 is the end point.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the EdgeEndPoint
| Equals(EdgeEndPoint)|  Determines whether this EdgeEndPoint is equal to another.
| Equals(Object)| Determines whether the specified object is equal to the current object.(Inherited from Object)
| Evaluate|  Evaluate the end point of the edge in 3d coordinates.
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace